Autodesk.Revit.DB.Architecture.SiteSubRegion.SetBoundary(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Set the given curve loops as the boundary of an existing SiteSubRegion.
curveLoops:
A collection of curve loops to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve loops cannot compose a valid boundary, that means:
no curve loop is contained in the given collection;
these curve loops intersect with each other for some of them;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the Sketch for the boundary of the current Subregion.
-or-
Cannot find an appropriate host topography surface for the SubRegion.
-or-
The given curve loops intersect with curve loops of existing SiteSubRegions hosted on the same TopographySurface.
-or-
The boundary of SubRegion is entirely inside or overlaps at least one existing BuildingPad hosted on the same TopographySurface. This behavior is not allowed.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this SiteSubRegion is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this SiteSubRegion is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this SiteSubRegion has no open transaction.
Since:
2014

Autodesk.Revit.DB.Architecture.SiteSubRegion.GetBoundary
Gets the boundary of current subregion.
Returns:
The curve loops that represent the boundary.
Since:
2014

Autodesk.Revit.DB.Architecture.SiteSubRegion.IsValidBoundary(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Identifies whether the given curve loops compose a valid boundary.
Remarks:
The curve loops are valid if they don't intersect with each other; each curve loop is closed;
and each loop is planar and lies on a plane parallel to the horizontal(XY) plane.
curveLoops:
The curve loops to be checked.
Returns:
True if the given curve loops don't intersect with each other; each curve loop is closed;
and each loop is planar and lies on a plane parallel to the horizontal(XY) plane.
Any requirement above is not satisfied or no curve loops contained, returns false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Architecture.SiteSubRegion.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.ElementId)
Creates a new SiteSubRegion element with assigned TopographySurface to be hosted and adds it to the document.
Remarks:
This will create a new TopographySurface element which represents a subregion with a host TopographySurface assigned.
If you need access to this Element you can obtain it from the TopographySurface property.
See Autodesk.Revit.DB.Architecture.SiteSubRegion.TopographySurface for details.
document:
The document to be modified.
curveLoops:
The boundary of the subregion.
hostTopoSurfaceId:
The element id of a TopographySurface assigned to be a host of new created SiteSubRegion.
Returns:
The new SubRegion surface.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve loops cannot compose a valid boundary, that means:
no curve loop is contained in the given collection;
these curve loops intersect with each other for some of them;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane.
-or-
The ElementId hostTopoSurfaceId does not represent a TopographySurface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the Sketch for the boundary of the current Subregion.
-or-
Cannot associate the new subregion with the assigned host because there is no geometric overlap, or they have mismatched design options.
-or-
The given curve loops intersect with curve loops of existing SiteSubRegions hosted on the same TopographySurface.
-or-
The boundary of SubRegion is entirely inside or overlaps at least one existing BuildingPad hosted on the same TopographySurface. This behavior is not allowed.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.Architecture.SiteSubRegion.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Creates a new SiteSubRegion element and adds it to the document.
Remarks:
This will create a new TopographySurface element which represents a subregion.
If you need access to this Element you can obtain it from Autodesk.Revit.DB.Architecture.SiteSubRegion.TopographySurface.
document:
The document to be modified.
curveLoops:
The boundary of the subregion.
Returns:
The new SubRegion surface.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve loops cannot compose a valid boundary, that means:
no curve loop is contained in the given collection;
these curve loops intersect with each other for some of them;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the Sketch for the boundary of the current Subregion.
-or-
Cannot find an appropriate host TopographySurface for the Subregion.
-or-
The given curve loops intersect with curve loops of existing SiteSubRegions hosted on the same TopographySurface.
-or-
The boundary of SubRegion is entirely inside or overlaps at least one existing BuildingPad hosted on the same TopographySurface. This behavior is not allowed.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.Architecture.SiteSubRegion.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Architecture.SiteSubRegion.HostId
The element id of the topography surface hosting this SiteSubRegion.
Since:
2014

Autodesk.Revit.DB.Architecture.SiteSubRegion.TopographySurface
The TopographySurface element which this SiteSubRegion represents.
Since:
2014

Autodesk.Revit.DB.Architecture.SiteSubRegion
Represents a proxy class exposing the interfaces needed to access details of a subregion.
Remarks:
In the Revit database, both TopographySurface elements and subregion elements are represented by the same TopographySurface element subclass.
In the Revit API, this SiteSubRegion class exists to separate the interfaces for subregions from those of topography surfaces.
Since:
2014